# SizingFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..SizingFailed Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Sizing failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SizingFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SizingFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SizingFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace